tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

cask_args appdir: "~/Applications"

brew "bash"
brew "bash-completion@2"
brew "bat"
brew "cmake"
brew "coreutils"
brew "dfc"
#brew "emscripten"
brew "findutils"
brew "fzf"
brew "git"
brew "git-delta"
brew "git-flow"
#brew "git-lfs"
brew "gnu-sed"
brew "gnupg"
# brew "go"
# brew "graphviz"
brew "grep"
brew "htop"
brew "imagemagick"
#brew "imagemagick@6"
brew ios-webkit-debug-proxy
brew "jq"
brew "kitty"
brew "libimobiledevice"
#brew "llvm"
#brew "lua"
#brew "luajit"
brew "mas"
#brew "maven"
brew "n"
#brew "neovim"
#brew "nginx"
#brew "openssh"
brew "p7zip"
# brew "pyenv"
# brew "pyenv-virtualenv"
brew "rbenv"
brew "rename"
brew "rlwrap"
brew "screen"
#brew "sqlite"
#brew "ssh-copy-id"
#brew "switchjdk"
brew "transmission-cli"
brew "tree"
brew "vim"
brew "watchman"
brew "wget"
brew "woff2"
brew "zsh"
cask "android-studio"
cask "beardedspice"
cask "bettertouchtool"
#cask "brave"
# cask "figma"
#cask "filezilla"
cask "google-chrome"
# cask "iterm2"
cask "java"
#cask "java6"
#cask "kodi"
# cask "multipass"
# cask "ngrok"
#cask "openemu"
cask "pgadmin4"
#cask "postgres", args: { appdir: "/Applications" }
#cask "processing"
#cask "racket"
#cask "sketch"
#cask "skitch"
cask "slack"
# cask "sourcetree"
#cask "spectacle"
cask "spotify"
# cask "sqlitestudio"
cask "sublime-merge"
cask "sublime-text"
cask "teamviewer"
#cask "the-unarchiver"
#cask "transmission"
#cask "tunnelblick"
#cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
cask "xquartz"

